import { z } from "zod";

export const loginSchema = z.object({
  firstName: z
    .string()
    .min(2, { message: "حداقل باید 2 حرف باشد." })
    .max(50, { message: "حداکثر مجاز 50 حرف است." })
    .regex(/^[آ-ی]+$/u, { message: "نام باید فقط شامل حروف فارسی باشد." })
    .nonempty({ message: "این فیلد اجباری است و نمی‌تواند خالی باشد." }),
  lastName: z
    .string()
    .min(2, { message: "حداقل باید 2 حرف باشد." })
    .max(50, { message: "حداکثر مجاز 50 حرف است." })
    .regex(/^[آ-ی]+$/u, {
      message: "نام خانوادگی باید فقط شامل حروف فارسی باشد.",
    })
    .nonempty({ message: "این فیلد اجباری است و نمی‌تواند خالی باشد." }),
  phoneNumber: z
    .string()
    .min(10, { message: "حداقل باید 10 رقم باشد." })
    .max(15, { message: "حداکثر مجاز 15 رقم است." })
    .regex(/^09[0-9]{9}$/, {
      message: "شماره موبایل باید با فرمت درست وارد شود.",
    })
    .nonempty({ message: "این فیلد اجباری است و نمی‌تواند خالی باشد." }),
  password: z
    .string()
    .min(4, { message: "حداقل باید 4 کاراکتر باشد." })
    .max(10, { message: "حداکثر مجاز 10 کاراکتر است." })
    .regex(/^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z]).{4,10}$/, {
      message:
        "رمز عبور باید حاوی حداقل یک عدد، یک حرف لاتین بزرگ و یک حرف لاتین کوچک باشد.",
    })
    .nonempty({ message: "این فیلد اجباری است و نمی‌تواند خالی باشد." }),
});
